Locked-Inc/STAR/e2-studio-star-rx72n-firmware/src/hardware_init.c
  /* Host SPI (RSPI2 channel A on PORTD) */
  k_pin_host_copi = k_rx_pd_1, /**< PD.1 - COPI (RSPI2 controller out) */
  k_pin_host_cipo = k_rx_pd_2, /**< PD.2 - CIPO (RSPI2 controller in) */
  k_pin_host_sclk = k_rx_pd_3, /**< PD.3 - SCLK (RSPI2 clock) */
  k_pin_host_cs0  = k_rx_pd_4, /**< PD.4 - CS0 (RSPI2 chip select) */

  /* MTU Encoder clock inputs (front wheels) */
  k_pin_enc0_pha = k_rx_p2_4, /**< P2.4 - MTCLKA (encoder 0 phase A) */
  k_pin_enc0_phb = k_rx_p2_5, /**< P2.5 - MTCLKB (encoder 0 phase B) */
  k_pin_enc1_pha = k_rx_pa_1, /**< PA.1 - MTCLKC (encoder 1 phase A) */
  k_pin_enc1_phb = k_rx_pc_5, /**< PC.5 - MTCLKD (encoder 1 phase B) */

  /* TPU Encoder clock inputs (rear wheels) */
  k_pin_enc2_pha = k_rx_pc_2, /**< PC.2 - TCLKA (encoder 2 phase A) */
  k_pin_enc2_phb = k_rx_pa_3, /**< PA.3 - TCLKB (encoder 2 phase B) */
  k_pin_enc3_pha = k_rx_pc_0, /**< PC.0 - TCLKC (encoder 3 phase A) */
  k_pin_enc3_phb = k_rx_pb_3, /**< PB.3 - TCLKD (encoder 3 phase B) */

  /* GPTW PWM outputs (4 motors × 2 pins = PH + EN, all on PORT E) */
  k_pin_motor0_ph = k_rx_pe_5, /**< PE.5 - GTIOC0A (motor 0 phase, pin 106) */
  k_pin_motor0_en = k_rx_pe_2, /**< PE.2 - GTIOC0B (motor 0 enable, pin 109) */
  k_pin_motor1_ph = k_rx_pe_4, /**< PE.4 - GTIOC1A (motor 1 phase, pin 107) */
  k_pin_motor1_en = k_rx_pe_1, /**< PE.1 - GTIOC1B (motor 1 enable, pin 110) */
  k_pin_motor2_ph = k_rx_pe_3, /**< PE.3 - GTIOC2A (motor 2 phase, pin 108) */
  k_pin_motor2_en = k_rx_pe_0, /**< PE.0 - GTIOC2B (motor 2 enable, pin 111) */
  k_pin_motor3_ph = k_rx_pe_7, /**< PE.7 - GTIOC3A (motor 3 phase, pin 101) */
  k_pin_motor3_en = k_rx_pe_6, /**< PE.6 - GTIOC3B (motor 3 enable, pin 102) */

  /* ADC current sense (S12AD0, AN004-AN007) */
  k_pin_adc_an004 = k_rx_p4_4, /**< P4.4 - AN004 (motor 3 current) */
  k_pin_adc_an005 = k_rx_p4_5, /**< P4.5 - AN005 (motor 2 current) */
  k_pin_adc_an006 = k_rx_p4_6, /**< P4.6 - AN006 (motor 1 current) */
  k_pin_adc_an007 = k_rx_p4_7, /**< P4.7 - AN007 (motor 0 current) */
} rx_mpc_pin_t;

/** @brief Number of GPTW motor control pins */
typedef enum : uint8_t {
  k_gptw_pin_count = 8, /**< 4 motors x 2 pins (PH + EN) */
  k_sonar_count    = 4, /**< 4 HC-SR04 ultrasonic sensors */
  k_drv_cs_count   = 4, /**< 4 DRV8243S chip select pins */
} gpio_pin_counts_t;

/** @brief GPTW PWM frequency constant */
typedef enum : uint32_t {
  k_gptw_pwm_freq_hz = 20000, /**< 20 kHz PWM frequency */
} gptw_freq_t;

/** @brief GPTW dead-time constant */
typedef enum : uint16_t {
  k_gptw_deadtime_ns = 1000, /**< 1 us dead-time between complementary outputs */
} gptw_deadtime_t;

/** @brief RSPI2 channel number for host SPI */
typedef enum : uint8_t {
  k_host_spi_channel = 2, /**< RSPI2 = host SPI peripheral */
} spi_channel_t;

/** @brief I2C channel assignments */
typedef enum : uint8_t {
  k_i2c_channel_host = 0, /**< RIIC0 = host I2C (RPi5 comms) */
  k_i2c_channel_bms  = 1, /**< RIIC1 = BMS I2C (BQ4050) */
} i2c_channel_t;

/** @brief I2C bus frequency constants */
typedef enum : uint32_t {
  k_i2c_host_freq_hz = 400000, /**< 400 kHz fast mode for host */
  k_i2c_bms_freq_hz  = 100000, /**< 100 kHz standard mode for BMS */
} i2c_freq_t;

/** @brief Number of motor current ADC channels */
typedef enum : uint8_t {
  k_motor_adc_count = 4, /**< 4 motors = 4 current sense channels */
} adc_count_t;

/** @brief SCKCR3 reset/unconfigured state value (before clock initialization) */
static const uint8_t s_sckcr3_reset_state = 0U;

/**
 * @brief Initialize GPIO pins for motor control, I2C, and USB communication
 *
 * @details
 * Configures Multi-Function Pin Controller (MPC) for 8 critical pins used in STAR
 * robot application. All pins are configured for peripheral mode (not GPIO), with
 * specific PSEL values determined by hardware function.
 *
 * **Pin configuration:**
 * - **8× GPTW PWM pins** - Motor control via DRV8243 H-bridge drivers (PORT E)
 * - **2× I2C pins** - Sensor communication bus (SCL/SDA)
 * - **1× USB pin** - USB VBUS detection for CDC debug interface
 *
 * **Algorithm steps:**
 * 1. Validate all pin identifiers are within valid range
 * 2. Configure GPTW PWM pins (PSEL = 0x1E) for 4-motor control on PORT E
 * 3. Configure I2C pins (PSEL = 0x0F) for sensor bus
 * 4. Configure USB pin (PSEL = 0x11) for USB VBUS detect
 * 5. All operations use rx_mpc API with write-protect handling
 *
 * ## Pin Allocation Table
 *
 * | Pin | Port.Bit | Function | PSEL | Usage |
 * |-----|----------|----------|------|-------|
 * | PE5 | PORTE.5 | GTIOC0A | 0x1E | Motor 0 phase (pkg pin 106) |
 * | PE2 | PORTE.2 | GTIOC0B | 0x1E | Motor 0 enable (pkg pin 109) |
 * | PE4 | PORTE.4 | GTIOC1A | 0x1E | Motor 1 phase (pkg pin 107) |
 * | PE1 | PORTE.1 | GTIOC1B | 0x1E | Motor 1 enable (pkg pin 110) |
 * | PE3 | PORTE.3 | GTIOC2A | 0x1E | Motor 2 phase (pkg pin 108) |
 * | PE0 | PORTE.0 | GTIOC2B | 0x1E | Motor 2 enable (pkg pin 111) |
 * | PE7 | PORTE.7 | GTIOC3A | 0x1E | Motor 3 phase (pkg pin 101) |
 * | PE6 | PORTE.6 | GTIOC3B | 0x1E | Motor 3 enable (pkg pin 102) |
 * | P1.2 | PORT1.2 | SCL0 | 0x0F | I2C clock line |
 * | P1.3 | PORT1.3 | SDA0 | 0x0F | I2C data line |
 * | P1.6 | PORT1.6 | USB0_VBUS | 0x11 | USB VBUS detect input |
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok All 8 pins configured successfully
 * @retval k_rx_err_invalid_arg Pin identifier out of range (programming error)
 * @retval k_rx_err_hw_error MPC write-protect unlock failed (hardware fault)
 *
 * @pre PCLKB clock must be running (MPC registers require active clock)
 * @pre Must be called during single-threaded initialization (before RTOS starts)
 *
 * @post All 8 pins configured for peripheral mode (PMR = 1)
 * @post PWPR register locked (B0WI = 1, write protection active)
 * @post Motor control pins ready for MTU PWM output
 * @post I2C pins ready for RIIC communication
 * @post USB pin ready for VBUS detection
 *
 * @note **Thread Safety**: Not thread-safe. Must be called during initialization
 *       before ThreadX kernel starts. Do not call from running RTOS tasks.
 *
 * @note **Re-entrancy**: Not reentrant. Calling multiple times is safe (idempotent)
 *       but wastes CPU cycles re-writing same register values.
 *
 * @note **Performance**: Execution time ~15 µs @ 240 MHz (8 pins × 2 µs/pin).
 *       One-time initialization cost, not runtime overhead.
 *
 * @warning **Pin conflicts**: If pins are already in use by another peripheral,
 *          reconfiguring them here will break that peripheral's functionality.
 *          Ensure pin allocations match hardware schematic.
 *
 * @warning **Motor safety**: Motor control pins must be configured before enabling
 *          MTU channels. Unconfigured PWM pins can cause undefined motor behavior.
 *
 * @par Example - Normal Initialization:
 * @code
 * // Called from hardware_init() during boot
 * rx_err_t err = gpio_init();
 * if (err != k_rx_ok) {
 *     rx_log_error("HWINT", "GPIO init failed: %d", err);
 *     return err;
 * }
 *
 * // Now safe to initialize motor drivers
 * err = motor_init();
 * @endcode
 *
 * @par Example - Error Handling:
 * @code
 * rx_err_t err = gpio_init();
 * switch (err) {
 *     case k_rx_ok:
 *         rx_log_info("GPIO", "8 pins configured successfully");
 *         break;
 *     case k_rx_err_invalid_arg:
 *         // Programming error - invalid pin constant used
 *         rx_log_error("GPIO", "Invalid pin identifier");
 *         return err;
 *     case k_rx_err_hw_error:
 *         // Hardware fault - MPC registers not accessible
 *         rx_log_error("GPIO", "MPC hardware fault");
 *         return err;
 * }
 * @endcode
 *
 * @see rx_mpc_set_mtu_pwm() Configure pin for MTU PWM output
 * @see rx_mpc_set_riic() Configure pin for I2C bus function
 * @see rx_mpc_set_peripheral() Generic pin configuration
 * @see RX72N Manual Chapter 23 - Multi-Function Pin Controller
 *
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance
 * - **Rule 1** [OK] No goto, setjmp, recursion (sequential pin configuration)
 * - **Rule 2** [OK] No loops (8 pins configured sequentially, statically known)
 * - **Rule 3** [OK] No dynamic allocation (all register I/O)
 * - **Rule 4** [OK] Function is 45 lines (under 60 line limit)
 * - **Rule 5** [OK] 2 preconditions, 5 postconditions documented
 * - **Rule 6** [OK] Minimal scope (no local variables)
 * - **Rule 7** [OK] All rx_mpc_set_*() return values checked
 * - **Rule 8** [OK] Uses C23 typed enums for pin identifiers
 * - **Rule 9** [OK] Single level of function call dereferencing
 * - **Rule 10** [OK] Compiles with -Wall -Wextra -Werror
 */
static rx_err_t gpio_init(void)
{
  rx_err_t           err;
  static const char* s_tag = "GPIO";

  /* ---- Host I2C (RIIC0): SCL0 + SDA0 ---- */
  err = rx_mpc_set_riic((rx_port_pin_t)k_pin_host_scl0); /* P1.2 = SCL0 */
  RX_RETURN_ON_ERROR(err, s_tag, "SCL0 pin config failed");

  err = rx_mpc_set_riic((rx_port_pin_t)k_pin_host_sda0); /* P1.3 = SDA0 */
  RX_RETURN_ON_ERROR(err, s_tag, "SDA0 pin config failed");

  /* ---- BMS I2C (RIIC1): SCL1 + SDA1 ---- */
  err = rx_mpc_set_riic((rx_port_pin_t)k_pin_bms_scl1); /* P2.1 = SCL1 */
  RX_RETURN_ON_ERROR(err, s_tag, "SCL1 pin config failed");

