Locked-Inc/STAR/e2-studio-star-rx72n-firmware/src/hardware_init.c
  err = rx_mpc_set_riic((rx_port_pin_t)k_pin_bms_sda1); /* P2.0 = SDA1 */
  RX_RETURN_ON_ERROR(err, s_tag, "SDA1 pin config failed");

  /* ---- Host SPI (RSPI2): COPI + CIPO + SCLK + CS0 ---- */
  err = rx_mpc_set_rspi((rx_port_pin_t)k_pin_host_copi); /* PD.1 = COPI (RSPI2) */
  RX_RETURN_ON_ERROR(err, s_tag, "RSPI2 COPI pin config failed");

  err = rx_mpc_set_rspi((rx_port_pin_t)k_pin_host_cipo); /* PD.2 = CIPO (RSPI2) */
  RX_RETURN_ON_ERROR(err, s_tag, "RSPI2 CIPO pin config failed");

  err = rx_mpc_set_rspi((rx_port_pin_t)k_pin_host_sclk); /* PD.3 = SCLK (RSPI2) */
  RX_RETURN_ON_ERROR(err, s_tag, "RSPI2 SCLK pin config failed");

  err = rx_mpc_set_rspi((rx_port_pin_t)k_pin_host_cs0); /* PD.4 = CS0 (RSPI2) */
  RX_RETURN_ON_ERROR(err, s_tag, "RSPI2 CS0 pin config failed");

  /* ---- MTU encoder clock inputs (front wheels only) ---- */
  err = rx_mpc_set_mtu_encoder((rx_port_pin_t)k_pin_enc0_pha); /* P2.4 = MTCLKA */
  RX_RETURN_ON_ERROR(err, s_tag, "MTCLKA pin config failed");

  err = rx_mpc_set_mtu_encoder((rx_port_pin_t)k_pin_enc0_phb); /* P2.5 = MTCLKB */
  RX_RETURN_ON_ERROR(err, s_tag, "MTCLKB pin config failed");

  err = rx_mpc_set_mtu_encoder((rx_port_pin_t)k_pin_enc1_pha); /* PA.1 = MTCLKC */
  RX_RETURN_ON_ERROR(err, s_tag, "MTCLKC pin config failed");

  err = rx_mpc_set_mtu_encoder((rx_port_pin_t)k_pin_enc1_phb); /* PC.5 = MTCLKD */
  RX_RETURN_ON_ERROR(err, s_tag, "MTCLKD pin config failed");

  /* ---- TPU encoder clock inputs (rear wheels) ---- */
  err = rx_mpc_set_tpu_encoder((rx_port_pin_t)k_pin_enc2_pha); /* PC.2 = TCLKA */
  RX_RETURN_ON_ERROR(err, s_tag, "TCLKA pin config failed");

  err = rx_mpc_set_tpu_encoder((rx_port_pin_t)k_pin_enc2_phb); /* PA.3 = TCLKB */
  RX_RETURN_ON_ERROR(err, s_tag, "TCLKB pin config failed");

  err = rx_mpc_set_tpu_encoder((rx_port_pin_t)k_pin_enc3_pha); /* PC.0 = TCLKC */
  RX_RETURN_ON_ERROR(err, s_tag, "TCLKC pin config failed");

  err = rx_mpc_set_tpu_encoder((rx_port_pin_t)k_pin_enc3_phb); /* PB.3 = TCLKD */
  RX_RETURN_ON_ERROR(err, s_tag, "TCLKD pin config failed");

  /* ---- GPTW PWM outputs (4 motors × PH + EN = 8 pins) ---- */
  const rx_port_pin_t gptw_pins[] = {(rx_port_pin_t)k_pin_motor0_ph,
                                     (rx_port_pin_t)k_pin_motor0_en,
                                     (rx_port_pin_t)k_pin_motor1_ph,
                                     (rx_port_pin_t)k_pin_motor1_en,
                                     (rx_port_pin_t)k_pin_motor2_ph,
                                     (rx_port_pin_t)k_pin_motor2_en,
                                     (rx_port_pin_t)k_pin_motor3_ph,
                                     (rx_port_pin_t)k_pin_motor3_en};

  for (uint8_t i = 0; i < k_gptw_pin_count; i++) {
    err = rx_mpc_set_gptw(gptw_pins[i]);
    RX_RETURN_ON_ERROR(err, s_tag, "GPTW pin config failed");
  }

  /* ---- ADC current sense (AN004-AN007 on P4.4-P4.7) ---- */
  err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an004); /* P4.4 = AN004 */
  RX_RETURN_ON_ERROR(err, s_tag, "AN004 pin config failed");

  err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an005); /* P4.5 = AN005 */
  RX_RETURN_ON_ERROR(err, s_tag, "AN005 pin config failed");

  err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an006); /* P4.6 = AN006 */
  RX_RETURN_ON_ERROR(err, s_tag, "AN006 pin config failed");

  err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an007); /* P4.7 = AN007 */
  RX_RETURN_ON_ERROR(err, s_tag, "AN007 pin config failed");

  /* ---- USB VBUS detect (P1.6 = USB0_VBUS) ---- */
  err = rx_mpc_set_usb_vbus((rx_port_pin_t)k_pin_usb_vbus);
  RX_RETURN_ON_ERROR(err, s_tag, "USB VBUS pin config failed");

  /* ---- HC-SR04 Sonar triggers (GPIO output, initial LOW) ---- */
  const rx_port_pin_t sonar_trig_pins[k_sonar_count] = {
    (rx_port_pin_t)k_pin_sonar_trig0, /* PF5 */
    (rx_port_pin_t)k_pin_sonar_trig1, /* PJ5 */
    (rx_port_pin_t)k_pin_sonar_trig2, /* PJ3 */
    (rx_port_pin_t)k_pin_sonar_trig3  /* P33 */
  };

  for (uint8_t i = 0; i < k_sonar_count; i++) {
    err = rx_mpc_set_gpio(sonar_trig_pins[i]);
    RX_RETURN_ON_ERROR(err, s_tag, "Sonar trigger MPC config failed");

    const uint8_t            port = rx_port_from_pin(sonar_trig_pins[i]);
    const uint8_t            pin  = rx_pin_from_pin(sonar_trig_pins[i]);
    volatile rx_port_regs_t* regs = rx_port_get_base(port);
    RX_ASSERT(regs != nullptr, "Invalid sonar trigger port");
    regs->pmr &= ~(uint8_t)(1U << pin);  /* GPIO mode */
    regs->podr &= ~(uint8_t)(1U << pin); /* Initial LOW */
    regs->pdr |= (uint8_t)(1U << pin);   /* Output */
  }

  /* ---- HC-SR04 Sonar echoes (GPIO input) ---- */
  const rx_port_pin_t sonar_echo_pins[k_sonar_count] = {
    (rx_port_pin_t)k_pin_sonar_echo0, /* P03 / IRQ11 */
    (rx_port_pin_t)k_pin_sonar_echo1, /* P02 / IRQ10 */
    (rx_port_pin_t)k_pin_sonar_echo2, /* P01 / IRQ9 */
    (rx_port_pin_t)k_pin_sonar_echo3  /* P00 / IRQ8 */
  };

  for (uint8_t i = 0; i < k_sonar_count; i++) {
    err = rx_mpc_set_gpio(sonar_echo_pins[i]);
    RX_RETURN_ON_ERROR(err, s_tag, "Sonar echo MPC config failed");

    const uint8_t            port = rx_port_from_pin(sonar_echo_pins[i]);
    const uint8_t            pin  = rx_pin_from_pin(sonar_echo_pins[i]);
    volatile rx_port_regs_t* regs = rx_port_get_base(port);
    RX_ASSERT(regs != nullptr, "Invalid sonar echo port");
    regs->pmr &= ~(uint8_t)(1U << pin); /* GPIO mode */
    regs->pdr &= ~(uint8_t)(1U << pin); /* Input */
  }

  /* ---- DRV8243S SPI chip selects (GPIO output, initial HIGH = deselected) ---- */
  const rx_port_pin_t drv_cs_pins[k_drv_cs_count] = {
    (rx_port_pin_t)k_pin_drv_cs0, /* P74 */
    (rx_port_pin_t)k_pin_drv_cs1, /* PC1 */
    (rx_port_pin_t)k_pin_drv_cs2, /* PB5 */
    (rx_port_pin_t)k_pin_drv_cs3  /* PB4 */
  };

  for (uint8_t i = 0; i < k_drv_cs_count; i++) {
    err = rx_mpc_set_gpio(drv_cs_pins[i]);
    RX_RETURN_ON_ERROR(err, s_tag, "DRV CS MPC config failed");

    const uint8_t            port = rx_port_from_pin(drv_cs_pins[i]);
    const uint8_t            pin  = rx_pin_from_pin(drv_cs_pins[i]);
    volatile rx_port_regs_t* regs = rx_port_get_base(port);
    RX_ASSERT(regs != nullptr, "Invalid DRV CS port");
    regs->pmr &= ~(uint8_t)(1U << pin); /* GPIO mode */
    regs->podr |= (uint8_t)(1U << pin); /* Initial HIGH (deselected) */
    regs->pdr |= (uint8_t)(1U << pin);  /* Output */
  }

  /* ---- DRV8243S SPI data (SCI7 alternate function P90-P92) ---- */
  err = rx_mpc_set_sci((rx_port_pin_t)k_pin_drv_sclk); /* P91 = SCK7 */
  RX_RETURN_ON_ERROR(err, s_tag, "SCI7 SCK pin config failed");

  err = rx_mpc_set_sci((rx_port_pin_t)k_pin_drv_copi); /* P90 = COPI (SCI7) */
  RX_RETURN_ON_ERROR(err, s_tag, "SCI7 COPI pin config failed");

